proglang/disclaimer-on-books.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>A disclaimer concerning links to book vendors on this site</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-02-20 14:55:01 IST"/>
<meta name="author" content="Mayer Goldberg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">A disclaimer concerning links to book vendors on this site</h1>

<p>When I link my website to book pages on some vendors' sites, I do this to help those interested in the given book to
</p><ul>
<li>
get copies quickly
</li>
<li>
browse pages, read reviews, see related books fromt he vendor's website, etc
</li>
<li>
be able to recognize the book at the library, from its cover
</li>
</ul>

<p>What I am not doing is 
</p><ul>
<li>
endorsing/promoting the book
</li>
<li>
endorsing/promoting the author
</li>
<li>
endorsing/promoting the vendor
</li>
<li>
making money from promoting either the book or the vendor
</li>
</ul>

<p>When I wish to endorse a book, I do so specifically, stating <i>why</i> I think the book is valuable, and <i>for what</i>. Linking to a book is not an endorsment, but an acknowledgement that the book is commonly-used standard text on a subject. While I try to give useful lists of books for reference, you must use your own common sense and good judgement: If you try to buy even the most commonly used texts in an area, you are likely to go broke and run out of shelf space.
</p>
<p>
Most of my links to books are to <a href="http://www.amazon.com/">Amazon</a>. I do this because
</p><ul>
<li>
they have pages for lots of books, including some books that are no longer in print
</li>
<li>
they offer previewing of selected pages
</li>
<li>
they offer customer reviews
</li>
<li>
it is more convenient for me to link to a single vendor, when possible, than to look for a book all over the web
</li>
</ul>

<p>I don't particularly like Amazon these days. In the past, I used to shop there more often. These days I try to shop elsewhere. I am not making any money by linking to Amazon, nor do I consider this venue appropriate for my website. 
</p><div id="postamble">
<p class="author"> Author: Mayer Goldberg
</p>
<p class="date"> Date: 2011-02-20 14:55:01 IST</p>
</div>
</div>
</body>
</html>
